app/views/users/_form.html.erb


  <% @addresses = Address.where(user_id: current_user.id) %>
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1  [["user_id", 1]]