app/controllers/charges_controller.rb

  def create
    # Amount in cents
    cart_total
    @amount = @cart_total * 100
    p ""
    p @params
    customer = Stripe::Customer.create(
      :email => params[:stripeEmail],
      :source  => params[:stripeToken]
    )

    charge = Stripe::Charge.create(
      :customer    => customer.id,
      :amount      => @amount,
      :description => 'Rails Stripe customer',
      :currency    => 'usd'
    )

    # create an order history
    @order = Order.new(item_ids_quantities: current_user.cart, user_id: current_user.id)

    # clear cart upon order history creation
    if @order.save
---
INSERT INTO "orders" ("item_ids_quantities", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_ids_quantities", "46246,1,86056,1,"], ["user_id", 2], ["created_at", "2015-12-13 23:26:41.526719"], ["updated_at", "2015-12-13 23:26:41.526719"]]