app/controllers/items_controller.rb

UPDATE "items" SET "caffeine" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["caffeine", "regular"], ["updated_at", "2016-01-01 21:27:09.267933"], ["id", 54045]]
---
  def update
    if @item.update(item_params)

INSERT INTO "items" ("item_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["item_name", "dark"], ["created_at", "2016-01-01 20:01:20.228291"], ["updated_at", "2016-01-01 20:01:20.228291"]]
---
  def create
    @item = Item.new(item_params)
    if @item.save