app/controllers/orders_controller.rb

  def index
    @orders = Order.where(user_id: current_user.id)
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]

  def recent

    order = Order.last
---
SELECT  "orders".* FROM "orders"  ORDER BY "orders"."id" DESC LIMIT 1