app/controllers/users_controller.rb

UPDATE "users" SET "cart" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["cart", "46246,1,"], ["updated_at", "2015-12-13 23:22:18.761740"], ["id", 2]]
---
  def add_to_cart
    # check if the item is already in cart
    if current_user.cart.split(',').include?(params[:item_id])

      flash[:already_in_cart] = 'Item already in cart'
      redirect_to '/items'
    else
    # Add item.id & desired quantity to user.cart string
      item_id_qty = current_user.cart + params[:item_id] + ',' + params[:item_qty] + ','
      current_user.update(cart: item_id_qty)

UPDATE "users" SET "cart" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["cart", "48782,2,68540,1,"], ["updated_at", "2015-12-29 01:00:48.965218"], ["id", 1]]
---
  def destroy_from_cart
    item_id = params[:item_id]
    updated_cart = current_user.cart.sub(/#{item_id},\d+,/, "")
    current_user.update(cart: updated_cart)

SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1  [["user_id", 1]]
---
  def cart
    @addresses = Address.where(user_id: current_user.id)

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]
---
  def order_history
    @orders = Order.where(user_id: current_user.id)

SELECT  "orders".* FROM "orders"  ORDER BY "orders"."id" DESC LIMIT 1
---
  def last_order
    order = Order.last